# SQL Statements and Operators

---------

Pattern Matching
-----------

What would be the output of the following query: 'select * from employee where first_name like "%ee%";'?

---------------

Answer:
------------

It will display the details of all the employees whose name contains ‘ee’.

--------------

Feedback:
--------------

The % character can replace any number of preceding and trailing characters.

----------------

Reading the Documentation
------------

Refer to the MySQL documentation online and answer the following question:

Which of the following wildcards are supported in SQL?

-------------------

Both % and _ (underscore)

----------

% is a multi-character wildcard, whereas _ is a single-character wildcard. For example, using "_r%" would return the words with the second character as r, followed by zero or more characters at the end.

-----------------

Operators
----------

With SQL, how do you select all the records from a table named ‘employees’ where the ‘LastName’ is alphabetically between (and includes) ‘Joshi’ and ‘Sharma’?

----------------

select * from employees where LastName between ‘Joshi’ and ‘Sharma’;

-----------------

This query will return employees who have Joshi and Sharma as surnames, along with all the surnames that are in-between alphabetically.

----------------

Operators
--------

Which of the queries given below would return the same output? 

More than one option may be correct.

-----------------

select * from employees where EmpID in (2,3,4, 5);

select * from employees where EmpID between 2 and 5;

select * from employees where EmpID >= 2 and EmpID <= 5;

--------------

Feedback:

This query will return the details of the employees with employee ids 2, 3, 4 and 5.

-------------------

Basic Select
------------

Description

Consider the following table employees containing the following columns:

Employees

![](https://media-doselect.s3.amazonaws.com/generic/OqNgkRAgJpJMpzxNJZMXNdYXR/Employee_Table.PNG)

Write a query to determine the first names of all employees.

----------------------

Query
--------

    use upgrad;

    # Write your code below
    select firstname from Employees;

# https://live.upgrad.com/_join/uVyRNU0YUPjLltGs6xRdD5s9VkKUSEIW

## LOAD SQL

In [2]:
%load_ext sql

In [5]:
%%sql 

sqlite:///test.db

## RUN SQL

In [6]:
%%sql 

create table sample(column_1 int, column_2 varchar)

 * sqlite:///test.db
Done.

[]

In [7]:
%%sql

select * from sample

 * sqlite:///test.db
Done.

[]

In [8]:
%%sql 

CREATE TABLE Subject ( Sub_ID INT, Sub_Name varchar(20) );

 * sqlite:///test.db
Done.

[]

In [9]:
%%sql

select * from Subject

 * sqlite:///test.db
Done.

[]

In [10]:
%%sql 

Insert into Subject Values (1,'English'); 

Insert into Subject(Sub_Name) Values ('Hindi'); 

Insert into Subject Values (1,'English'), (2,'French'), (2,'Science'), (2,'Maths');

 * sqlite:///test.db
1 rows affected.
1 rows affected.
4 rows affected.

[]

In [12]:
%%sql

Insert into Subject(Sub_Name) Values ('Spanish'); 

select * from Subject

 * sqlite:///test.db
1 rows affected.
Done.

[(1, 'English'),
 (None, 'Hindi'),
 (1, 'English'),
 (2, 'French'),
 (2, 'Science'),
 (2, 'Maths'),
 (None, 'Spanish')]

In [13]:
%%sql 

insert into sample values (1,'abc'),(2,'abcd'); 

select * from sample;

 * sqlite:///test.db
2 rows affected.
Done.

[(1, 'abc'), (2, 'abcd')]

In [14]:
%%sql select * from Subject

 * sqlite:///test.db
Done.

[(1, 'English'),
 (None, 'Hindi'),
 (1, 'English'),
 (2, 'French'),
 (2, 'Science'),
 (2, 'Maths'),
 (None, 'Spanish')]

In [16]:
%%sql 

CREATE TABLE Student ( ID int(6) NOT NULL, NAME varchar(10) NOT NULL, ADDRESS varchar(20) );

 * sqlite:///test.db
(sqlite3.OperationalError) table Student already exists
[SQL: CREATE TABLE Student ( ID int(6) NOT NULL, NAME varchar(10) NOT NULL, ADDRESS varchar(20) );]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [17]:
%%sql 

Insert into Student(ID, ADDRESS) Values(1,'Banglore');

 * sqlite:///test.db
(sqlite3.IntegrityError) NOT NULL constraint failed: Student.NAME
[SQL: Insert into Student(ID, ADDRESS) Values(1,'Banglore');]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [19]:
%%sql 

Insert into Student Values (1,NULL,'Banglore');

 * sqlite:///test.db
(sqlite3.IntegrityError) NOT NULL constraint failed: Student.NAME
[SQL: Insert into Student Values (1,NULL,'Banglore');]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [18]:
%%sql 

CREATE TABLE Student1 ( ID int(6) NOT NULL UNIQUE, NAME varchar(10), ADDRESS varchar(20) );

 * sqlite:///test.db
Done.

[]

In [22]:
%%sql 

Insert into Student1 Values (1,'Deepak','Banglore');

 * sqlite:///test.db
(sqlite3.IntegrityError) UNIQUE constraint failed: Student1.ID
[SQL: Insert into Student1 Values (1,'Deepak','Banglore');]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [24]:
%%sql 

Insert into Student1 Values (2,'Deepak','Banglore')

 * sqlite:///test.db
1 rows affected.

[]

In [25]:
%%sql 

CREATE TABLE Student2 ( ID int(6), NAME varchar(10), ADDRESS varchar(20), PRIMARY KEY(ID) )

 * sqlite:///test.db
Done.

[]

In [26]:
%%sql 

Insert into Student2 Values (2,'Deepak','Banglore')

 * sqlite:///test.db
1 rows affected.

[]

In [27]:
%%sql 

Insert into Student2 Values (2,'Deepak','Banglore')

 * sqlite:///test.db
(sqlite3.IntegrityError) UNIQUE constraint failed: Student2.ID
[SQL: Insert into Student2 Values (2,'Deepak','Banglore')]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [28]:
%%sql 

CREATE TABLE Student3 ( ID int(6) NOT NULL, NAME varchar(10) NOT NULL, AGE int NOT NULL CHECK (AGE >= 18) )

 * sqlite:///test.db
Done.

[]

In [29]:
%%sql 

Insert into Student3 Values (2,'Deepak',13)

 * sqlite:///test.db
(sqlite3.IntegrityError) CHECK constraint failed: Student3
[SQL: Insert into Student3 Values (2,'Deepak',13)]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [30]:
%%sql 

CREATE TABLE Student4 ( ID int(6) NOT NULL, NAME varchar(10) NOT NULL, AGE int DEFAULT 18 );

 * sqlite:///test.db
Done.

[]

In [33]:
%%sql 

Insert into Student4(ID, NAME) Values(4,'jAIN ');

SELECT * FROM Student4

 * sqlite:///test.db
1 rows affected.
Done.

[(4, 'jAIN ', 18)]

In [34]:
%%sql 

CREATE TABLE Customers ( C_ID int NOT NULL, NAME VARCHAR(10) NOT NULL, ADDRESS VARCHAR(30) )

 * sqlite:///test.db
Done.

[]

In [35]:
%%sql Insert into Customers Values (2,'Deepak','Banglore')

 * sqlite:///test.db
1 rows affected.

[]

In [44]:
%%sql select * from Customers

 * sqlite:///test.db
Done.

[(2, 'Deepak', 'Banglore')]

In [37]:
%%sql 

CREATE TABLE Orders ( O_ID int NOT NULL, ORDER_NO int NOT NULL, C_ID int, PRIMARY KEY (O_ID), FOREIGN KEY (C_ID) REFERENCES Customers(C_ID) )

 * sqlite:///test.db
Done.

[]

In [40]:
%%sql Insert into Orders Values (200,'o200',2)

 * sqlite:///test.db
1 rows affected.

[]

In [43]:
%%sql select * from Orders

 * sqlite:///test.db
Done.

[(200, 'o200', 2)]

In [42]:
%%sql Insert into Orders Values (200,'o200',3)

 * sqlite:///test.db
(sqlite3.IntegrityError) UNIQUE constraint failed: Orders.O_ID
[SQL: Insert into Orders Values (200,'o200',3)]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [45]:
%%sql Insert into Orders Values (300,'o300',3)

 * sqlite:///test.db
1 rows affected.

[]